<?php
define("RATIO_COLOR_0","#ff8f8f");
define("RATIO_COLOR_UNDER_31","#ffafaf");
define("RATIO_COLOR_UNDER_61","#fdffaf");
define("RATIO_COLOR_UNDER_81","#faffff");
define("RATIO_COLOR_OVER_81","#afffaf");
// 教務室在室率表示の色設定

define("MONTH_USE_FOR_RATIO_CALC",3);
// 教務室在室率表示にて使用するデータ数(月単位)

$config_schedule = [
        '早朝' => ['08:00:00', '09:30:00'],
        '1限' => ['09:30:00', '11:00:00'],
        '休憩1' => ['11:00:00', '11:10:00'],
        '2限' => ['11:10:00', '12:40:00'],
        '休憩2' => ['12:40:00', '12:50:00'],
        '3限' => ['12:50:00', '14:20:00'],
        '休憩3' => ['14:20:00', '14:30:00'],
        '4限' => ['14:30:00', '16:00:00'],
        '休憩4' => ['16:00:00', '16:10:00'],
        '5限' => ['16:10:00', '17:40:00'],
        '休憩5' => ['17:40:00', '17:50:00'],
        '6限' => ['17:50:00', '19:20:00'],
        '夜間' => ['19:20:00', '22:00:00']
    ];
// 時間割区分設定

$config_weekdays = [
        2 => '月', 3 => '火', 4 => '水', 
        5 => '木', 6 => '金', 7 => '土'
   ];
// 曜日区分設定
// https://www.php.net/manual/ja/datetime.format.php


$config_statusList = ["退出","教務室","校内","校外"];
// 0, 1, 2, 3のオーダー 文言の設定

$config_tags = [
    "4096" => "就職",
    "2048" => "管理者",
    "1024" => "IT-AI",
    "512" => "IT-WEB",
    "256" => "IT-高度",
    "128" => "カーデザイン",
    "64" => "ミュージック",
    "32" => "CGアニメ",
    "16" => "CGグラフィック",
    "8" => "CG映像",
    "4" => "ゲームデザイン",
    "2" => "ゲーム制作",
    "1" => "ゲーム企画"
];
// 各ビットと役職の対応表
// HALIOSystem/manual/HALIO-CALID.pdfを参照


